## Plan Result (sbox-shutter)




<pre><code>Plan: 5 to add, 26 to change, 0 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;labs-goldenpath-felix&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;labs-goldenpath-felix&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;labs-goldenpath-felix&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;labs-goldenpath-felix&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;labs-goldenpath-felix&#34;]
* Update
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;cft-api-mgmt&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;hmcts-access&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;hmi-apim&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;idam-user-dashboard&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;idam-web-admin&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;idam-web-public&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;labs-louisehuyton-walkthrough&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;labs-zcwalkthrough-nodejs&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;plum&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;reformscan&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;cft-api-mgmt&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;hmi&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;idam&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;labs&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;plum&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;reform&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;cft-api-mgmt&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;hmcts-access&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;hmi-apim&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;idam-user-dashboard&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;idam-web-admin&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;idam-web-public&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;labs-louisehuyton-walkthrough&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;labs-zcwalkthrough-nodejs&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;plum&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;reformscan&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-cft-api-mgmt/endpoints/hmcts-cft-api-mgmt-shutter-sbox"
        name                          = "hmcts-cft-api-mgmt-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["hmcts-access"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-idam/endpoints/hmcts-hmcts-access-shutter-sbox"
        name                          = "hmcts-hmcts-access-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["hmi-apim"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-hmi/endpoints/hmcts-hmi-apim-shutter-sbox"
        name                          = "hmcts-hmi-apim-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-idam/endpoints/hmcts-idam-user-dashboard-shutter-sbox"
        name                          = "hmcts-idam-user-dashboard-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-idam/endpoints/hmcts-idam-web-admin-shutter-sbox"
        name                          = "hmcts-idam-web-admin-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["idam-web-public"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-idam/endpoints/hmcts-idam-web-public-shutter-sbox"
        name                          = "hmcts-idam-web-public-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["labs-goldenpath-felix"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-labs-goldenpath-felix-shutter-sbox"
      + origin_host_header            = (known after apply)
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-labs-goldenpath-felix"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-sbox-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = (known after apply)
        }
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["labs-louisehuyton-walkthrough"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-labs/endpoints/hmcts-labs-louisehuyton-walkthrough-shutter-sbox"
        name                          = "hmcts-labs-louisehuyton-walkthrough-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["labs-zcwalkthrough-nodejs"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-labs/endpoints/hmcts-labs-zcwalkthrough-nodejs-shutter-sbox"
        name                          = "hmcts-labs-zcwalkthrough-nodejs-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["plum"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-plum/endpoints/hmcts-plum-shutter-sbox"
        name                          = "hmcts-plum-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["reformscan"] will be updated in-place
  ~ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
        id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-reform/endpoints/hmcts-reformscan-shutter-sbox"
        name                          = "hmcts-reformscan-shutter-sbox"
      ~ tags                          = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_profile.main["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_profile" "main" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-cft-api-mgmt"
        name                = "hmcts-shutter-cft-api-mgmt"
      ~ tags                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.azurerm_cdn_profile.main["hmi"] will be updated in-place
  ~ resource "azurerm_cdn_profile" "main" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-hmi"
        name                = "hmcts-shutter-hmi"
      ~ tags                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.azurerm_cdn_profile.main["idam"] will be updated in-place
  ~ resource "azurerm_cdn_profile" "main" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-idam"
        name                = "hmcts-shutter-idam"
      ~ tags                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.azurerm_cdn_profile.main["labs"] will be updated in-place
  ~ resource "azurerm_cdn_profile" "main" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-labs"
        name                = "hmcts-shutter-labs"
      ~ tags                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.azurerm_cdn_profile.main["labs-goldenpath-felix"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-labs-goldenpath-felix"
      + resource_group_name = "shutter-app-sbox-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.shutter.azurerm_cdn_profile.main["plum"] will be updated in-place
  ~ resource "azurerm_cdn_profile" "main" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-plum"
        name                = "hmcts-shutter-plum"
      ~ tags                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.azurerm_cdn_profile.main["reform"] will be updated in-place
  ~ resource "azurerm_cdn_profile" "main" {
        id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-reform"
        name                = "hmcts-shutter-reform"
      ~ tags                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctscftapimgshuttersbox"
        name                              = "hmctscftapimgshuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["hmcts-access"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctshmctsaccshuttersbox"
        name                              = "hmctshmctsaccshuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["hmi-apim"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctshmiapimshuttersbox"
        name                              = "hmctshmiapimshuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctsidamusershuttersbox"
        name                              = "hmctsidamusershuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctsidamwebashuttersbox"
        name                              = "hmctsidamwebashuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["idam-web-public"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctsidamwebpshuttersbox"
        name                              = "hmctsidamwebpshuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["labs-goldenpath-felix"] will be created
  + resource "azurerm_storage_account" "shutter_store" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "RAGRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_0"
      + name                              = "hmctslabsgoldshuttersbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "shutter-app-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }

      + static_website {
          + error_404_document = "index.html"
          + index_document     = "index.html"
        }
    }

  # module.shutter.azurerm_storage_account.shutter_store["labs-louisehuyton-walkthrough"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctslabslouishuttersbox"
        name                              = "hmctslabslouishuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["labs-zcwalkthrough-nodejs"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctslabszcwashuttersbox"
        name                              = "hmctslabszcwashuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["plum"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctsplumshuttersbox"
        name                              = "hmctsplumshuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_storage_account.shutter_store["reformscan"] will be updated in-place
  ~ resource "azurerm_storage_account" "shutter_store" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/shutter-app-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctsreformscshuttersbox"
        name                              = "hmctsreformscshuttersbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (49 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.shutter.azurerm_template_deployment.custom_domain["labs-goldenpath-felix"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "labs-goldenpath-felix"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "labs-goldenpath-felix.sandbox.platform.hmcts.net"
          + "name"     = "hmcts-shutter-labs-goldenpath-felix/hmcts-labs-goldenpath-felix-shutter-sbox/labs-goldenpath-felix-sandbox-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-sbox-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["labs-goldenpath-felix"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "e6cacf63976f4cbdab831cc71c48565d"
        }
    }

Plan: 5 to add, 26 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1444,"Program":"tfcmt","SHA1":"","Target":"sbox-shutter","Vars":{}} -->